# Create Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralConnectionApprovalType..::..Create Method
StructuralConnectionApprovalType Class See Also
---
Creates a new StructuralConnectionApprovalType.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public static StructuralConnectionApprovalType Create(
	Document doc,
	string name
)
```

Visual Basic
---
```text
Public Shared Function Create ( _
	doc As Document, _
	name As String _
) As StructuralConnectionApprovalType
```

Visual C++
---
```text
public:
static StructuralConnectionApprovalType^ Create(
	Document^ doc,
	String^ name
)
```

# ### Parameters
doc
    Type: Autodesk.Revit.DB..::..Document
name
    Type: System..::..String A name for the new approval type. It must be unique within the document.
# ### Return Value
Created connection approval type.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..ArgumentsInconsistentException | The input name for approval type is not unique in the document. |

# See Also
StructuralConnectionApprovalType Class
Autodesk.Revit.DB.Structure Namespace